'use client';

type GarageEmptyProps = {
  onAddCar: () => void;
};

const GarageEmpty = ({ onAddCar }: GarageEmptyProps) => {
  return (
    <div className="bg-white rounded-[20px] p-[32px] text-center">
      <div className="flex flex-col items-center">
        <svg
          width="80"
          height="80"
          viewBox="0 0 80 80"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
          className="mb-[24px] text-[#8E9AAC]"
        >
          <path
            d="M66.667 16.667H53.3337V10.0003C53.3337 8.16033 52.6314 6.39584 51.3811 5.14559C50.1309 3.89534 48.3664 3.19299 46.5264 3.19299H33.3337C31.4937 3.19299 29.7292 3.89534 28.479 5.14559C27.2287 6.39584 26.5264 8.16033 26.5264 10.0003V16.667H13.3337C11.4937 16.667 9.72922 17.3693 8.47897 18.6196C7.22872 19.8698 6.52637 21.6343 6.52637 23.4743V63.5003C6.52637 67.3337 9.66705 70.4743 13.5004 70.4743H66.5004C70.3337 70.4743 73.4744 67.3337 73.4744 63.5003V23.4743C73.4744 21.6343 72.772 19.8698 71.5218 18.6196C70.2715 17.3693 68.507 16.667 66.667 16.667ZM33.3337 10.0003H46.667V16.667H33.3337V10.0003ZM66.667 63.5003H13.3337V23.4743H66.667V63.5003Z"
            fill="currentColor"
          />
          <path
            d="M26.6663 36.667H33.333C35.173 36.667 36.9375 35.9647 38.1878 34.7144C39.438 33.4642 40.1404 31.6997 40.1404 29.8597C40.1404 27.0263 37.733 24.727 34.8997 24.727C33.0597 24.727 31.2952 25.4293 30.0449 26.6796C28.7947 27.9298 28.0923 29.6943 28.0923 31.5343V36.667H26.6663Z"
            fill="currentColor"
          />
          <path
            d="M53.3333 36.667H60C61.84 36.667 63.6045 35.9647 64.8548 34.7144C66.105 33.4642 66.8073 31.6997 66.8073 29.8597C66.8073 27.0263 64.4 24.727 61.5667 24.727C59.7267 24.727 57.9622 25.4293 56.7119 26.6796C55.4617 27.9298 54.7593 29.6943 54.7593 31.5343V36.667H53.3333Z"
            fill="currentColor"
          />
        </svg>

        <h2 className="text-[24px] font-medium text-[#000814] mb-[16px]">
          Ваш гараж пуст
        </h2>

        <p className="text-[16px] text-[#697586] max-w-[460px] mb-[24px]">
          Добавьте автомобили в гараж, чтобы быстро находить запчасти и
          отслеживать историю обслуживания
        </p>

        <button
          onClick={onAddCar}
          className="py-[14px] px-[24px] rounded-[12px] bg-[#EC1C24] text-white text-[16px] font-medium flex items-center gap-[8px] hover:bg-[#D81B22] transition-colors"
        >
          <svg
            width="16"
            height="16"
            viewBox="0 0 16 16"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M15.1429 6.85714H9.14286V0.857143H6.85714V6.85714H0.857143V9.14286H6.85714V15.1429H9.14286V9.14286H15.1429V6.85714Z"
              fill="white"
            />
          </svg>
          Добавить автомобиль
        </button>
      </div>
    </div>
  );
};

export default GarageEmpty;
