import React from "react";

const HowToBuy = () => (
    <div className="w-layout-hflex flex-block-96">
    <h2 className="heading-13">Как покупать по оптовой цене</h2>
    <div className="text-block-50"><span className="text-span">Зарегистрируйтесь</span> как юридическое лицо</div>
    <div className="div-block-33">
      <div className="w-embed"><svg width="40" height="40" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M55 30C55 16.2 43.8 5 30 5C16.2 5 5 16.2 5 30C5 43.8 16.2 55 30 55C43.8 55 55 43.8 55 30ZM30 36.975V32.5H22.5C21.125 32.5 20 31.375 20 30C20 28.625 21.125 27.5 22.5 27.5H30V23.025C30 21.9 31.35 21.35 32.125 22.15L39.1 29.125C39.6 29.625 39.6 30.4 39.1 30.9L32.125 37.875C31.9488 38.0478 31.7253 38.1645 31.4829 38.2105C31.2404 38.2564 30.9897 38.2296 30.7625 38.1334C30.5352 38.0371 30.3416 37.8758 30.2059 37.6696C30.0702 37.4635 29.9986 37.2218 30 36.975Z" fill="currentColor" /></svg></div>
    </div>
    <div className="text-block-50"><span className="text-span-2">Подберите запчасти</span> или воспользуйтесь <span className="text-span-3">помощью</span></div>
    <div className="div-block-33">
      <div className="w-embed"><svg width="40" height="40" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M55 30C55 16.2 43.8 5 30 5C16.2 5 5 16.2 5 30C5 43.8 16.2 55 30 55C43.8 55 55 43.8 55 30ZM30 36.975V32.5H22.5C21.125 32.5 20 31.375 20 30C20 28.625 21.125 27.5 22.5 27.5H30V23.025C30 21.9 31.35 21.35 32.125 22.15L39.1 29.125C39.6 29.625 39.6 30.4 39.1 30.9L32.125 37.875C31.9488 38.0478 31.7253 38.1645 31.4829 38.2105C31.2404 38.2564 30.9897 38.2296 30.7625 38.1334C30.5352 38.0371 30.3416 37.8758 30.2059 37.6696C30.0702 37.4635 29.9986 37.2218 30 36.975Z" fill="currentColor" /></svg></div>
    </div>
    <div className="text-block-50">Добавьте адрес доставки и оформите заказ</div>
    <div className="div-block-33">
      <div className="w-embed"><svg width="40" height="40" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M55 30C55 16.2 43.8 5 30 5C16.2 5 5 16.2 5 30C5 43.8 16.2 55 30 55C43.8 55 55 43.8 55 30ZM30 36.975V32.5H22.5C21.125 32.5 20 31.375 20 30C20 28.625 21.125 27.5 22.5 27.5H30V23.025C30 21.9 31.35 21.35 32.125 22.15L39.1 29.125C39.6 29.625 39.6 30.4 39.1 30.9L32.125 37.875C31.9488 38.0478 31.7253 38.1645 31.4829 38.2105C31.2404 38.2564 30.9897 38.2296 30.7625 38.1334C30.5352 38.0371 30.3416 37.8758 30.2059 37.6696C30.0702 37.4635 29.9986 37.2218 30 36.975Z" fill="currentColor" /></svg></div>
    </div>
    <div className="text-block-50">Скачайте счет на оплату или оплатите заказ картой</div>
    <div className="div-block-33">
      <div className="w-embed"><svg width="40" height="40" viewBox="0 0 60 60" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M55 30C55 16.2 43.8 5 30 5C16.2 5 5 16.2 5 30C5 43.8 16.2 55 30 55C43.8 55 55 43.8 55 30ZM30 36.975V32.5H22.5C21.125 32.5 20 31.375 20 30C20 28.625 21.125 27.5 22.5 27.5H30V23.025C30 21.9 31.35 21.35 32.125 22.15L39.1 29.125C39.6 29.625 39.6 30.4 39.1 30.9L32.125 37.875C31.9488 38.0478 31.7253 38.1645 31.4829 38.2105C31.2404 38.2564 30.9897 38.2296 30.7625 38.1334C30.5352 38.0371 30.3416 37.8758 30.2059 37.6696C30.0702 37.4635 29.9986 37.2218 30 36.975Z" fill="currentColor" /></svg></div>
    </div>
    <div className="text-block-50">Получите заказ и закрывающие документы</div>
  </div>
);

export default HowToBuy; 