import React from "react";

const AboutProtekInfo = () => (
  <div className="w-layout-hflex flex-block-69-copy">
    <h2 className="heading-13">PROTEK – это</h2>
    <div className="w-layout-hflex flex-block-71">
      <div className="text-block-38">Электронные каталоги для подбора. Подбор конкретной автозапчасти с помощью электронных каталогов. Кроссировка по оригинальным номерам и возможность выбора артикула от разных производителей по разным ценам и уровню качества.</div>
      <div className="text-block-38">Сотрудничаем только с известными поставщиками и брендами, что страхует наших партнёров от приобретения контрафакта, что очень важно, с нами вы застрахованы от подделок</div>
    </div>
    <div className="w-layout-vflex flex-block-72">
      <div className="w-layout-vflex flex-block-73">
        <div className="w-embed">
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M19 6.77051H17C17 4.01051 14.76 1.77051 12 1.77051C9.24 1.77051 7 4.01051 7 6.77051H5C3.9 6.77051 3 7.67051 3 8.77051V20.7705C3 21.8705 3.9 22.7705 5 22.7705H19C20.1 22.7705 21 21.8705 21 20.7705V8.77051C21 7.67051 20.1 6.77051 19 6.77051ZM12 3.77051C13.66 3.77051 15 5.11051 15 6.77051H9C9 5.11051 10.34 3.77051 12 3.77051ZM12 13.7705C10.8913 13.772 9.81368 13.4041 8.93725 12.7251C8.06083 12.046 7.43551 11.0944 7.16 10.0205C6.99 9.39051 7.48 8.77051 8.13 8.77051C8.6 8.77051 8.98 9.11051 9.11 9.57051C9.28387 10.2036 9.66083 10.7621 10.1829 11.1602C10.7051 11.5582 11.3434 11.7738 12 11.7738C12.6566 11.7738 13.2949 11.5582 13.8171 11.1602C14.3392 10.7621 14.7161 10.2036 14.89 9.57051C15.02 9.11051 15.4 8.77051 15.87 8.77051C16.52 8.77051 17 9.39051 16.84 10.0205C16.5645 11.0944 15.9392 12.046 15.0627 12.7251C14.1863 13.4041 13.1087 13.772 12 13.7705Z" fill="currentColor" />
          </svg>
        </div>
        <div className="w-layout-hflex flex-block-74">
          <h3 className="heading-14">Оптово-розничная компания</h3>
          <div className="text-block-38">Мы работаем и с розничными клиентами, и с оптовыми покупателями</div>
        </div>
      </div>
      <div className="w-layout-vflex flex-block-73">
        <div className="w-embed">
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M19 6.77051H17C17 4.01051 14.76 1.77051 12 1.77051C9.24 1.77051 7 4.01051 7 6.77051H5C3.9 6.77051 3 7.67051 3 8.77051V20.7705C3 21.8705 3.9 22.7705 5 22.7705H19C20.1 22.7705 21 21.8705 21 20.7705V8.77051C21 7.67051 20.1 6.77051 19 6.77051ZM12 3.77051C13.66 3.77051 15 5.11051 15 6.77051H9C9 5.11051 10.34 3.77051 12 3.77051ZM12 13.7705C10.8913 13.772 9.81368 13.4041 8.93725 12.7251C8.06083 12.046 7.43551 11.0944 7.16 10.0205C6.99 9.39051 7.48 8.77051 8.13 8.77051C8.6 8.77051 8.98 9.11051 9.11 9.57051C9.28387 10.2036 9.66083 10.7621 10.1829 11.1602C10.7051 11.5582 11.3434 11.7738 12 11.7738C12.6566 11.7738 13.2949 11.5582 13.8171 11.1602C14.3392 10.7621 14.7161 10.2036 14.89 9.57051C15.02 9.11051 15.4 8.77051 15.87 8.77051C16.52 8.77051 17 9.39051 16.84 10.0205C16.5645 11.0944 15.9392 12.046 15.0627 12.7251C14.1863 13.4041 13.1087 13.772 12 13.7705Z" fill="currentColor" />
          </svg>
        </div>
        <div className="w-layout-hflex flex-block-74">
          <h3 className="heading-14">Надежный партнер</h3>
          <div className="text-block-38">Мы ценим долгосрочные отношения и стремимся к взаимовыгодному сотрудничеству</div>
        </div>
      </div>
      <div className="w-layout-vflex flex-block-73">
        <div className="w-embed">
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M19 6.77051H17C17 4.01051 14.76 1.77051 12 1.77051C9.24 1.77051 7 4.01051 7 6.77051H5C3.9 6.77051 3 7.67051 3 8.77051V20.7705C3 21.8705 3.9 22.7705 5 22.7705H19C20.1 22.7705 21 21.8705 21 20.7705V8.77051C21 7.67051 20.1 6.77051 19 6.77051ZM12 3.77051C13.66 3.77051 15 5.11051 15 6.77051H9C9 5.11051 10.34 3.77051 12 3.77051ZM12 13.7705C10.8913 13.772 9.81368 13.4041 8.93725 12.7251C8.06083 12.046 7.43551 11.0944 7.16 10.0205C6.99 9.39051 7.48 8.77051 8.13 8.77051C8.6 8.77051 8.98 9.11051 9.11 9.57051C9.28387 10.2036 9.66083 10.7621 10.1829 11.1602C10.7051 11.5582 11.3434 11.7738 12 11.7738C12.6566 11.7738 13.2949 11.5582 13.8171 11.1602C14.3392 10.7621 14.7161 10.2036 14.89 9.57051C15.02 9.11051 15.4 8.77051 15.87 8.77051C16.52 8.77051 17 9.39051 16.84 10.0205C16.5645 11.0944 15.9392 12.046 15.0627 12.7251C14.1863 13.4041 13.1087 13.772 12 13.7705Z" fill="currentColor" />
          </svg>
        </div>
        <div className="w-layout-hflex flex-block-74">
          <h3 className="heading-14">Гарантия качества</h3>
          <div className="text-block-38">Мы предлагаем только качественные запчасти от проверенных поставщиков</div>
        </div>
      </div>
    </div>
  </div>
);

export default AboutProtekInfo; 